create_power_domain PD

create_supply_port VDD 
create_supply_port VSS 

create_supply_net VDD
create_supply_net VSS

connect_supply_net VDD -ports VDD
connect_supply_net VSS -ports VSS

set_domain_supply_net PD -primary_power_net VDD -primary_ground_net VSS

