# FPU_ADD
# scenario constraints func_turbo@ff_m40

set_driving_cell -lib_cell INVX8_LVT [get_ports rclk]
set_driving_cell -lib_cell  INVX8_RVT [ remove_from_collection [all-inputs][get_ports rclk]]
set_clock_uncertainty -setup 0.1 [get_clock rclk]
set_clock_latency  0.6 [get_clock rclk]
set_clock_jitter 0.2 -corners {ff0p72vm40c}
